import React, { useEffect } from "react";
import "./ProductList.css";
import ProductItem from "../ProductItem/ProductItem";
import { useTelegram } from "../../hooks/useTelegram";

const ture = [
      {
         "uuid":"uT1",
         "name":"Провулками київського Кудрявця",
         "discription":"Дізнайтеся про літописні місця Києва та твори багатьох видатних киян – архітекторів, художників, письменників і акторів, які мешкали в цій місцевості у різні часи.",
         "type":"withHearing",
         "type1":"withVisual",
         "type2":"limitedMobility",
         "BarrierFree":"Так",
         "price": 1000,
         "length":"120 хв.",
         "language":"українська",
         "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
     },
     {
      "uuid":"uT2",
      "name":"Прогулянка театральним Києвом",
      "discription":"Ви дізнаєтеся, як і коли виникли театральні традиції Києва, про перші театри, їхніх корифеїв і сучасних майстрів сцени.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "BarrierFree":"Так",
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT3",
      "name":"Все починається з Університету",
      "discription":"Під час екскурсії ви дізнаєтеся, як Університет дав початок розбудові нового кварталу Києва, а також познайомитеся з історією створення навколо Червоного корпусу чудового парку та ботанічного саду.",
      "type":"withHearing",
      "type1":"withVisual",
      "type2":"limitedMobility",
      "price": 1000,
      "BarrierFree":"Так",
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT4",
      "name":"Шлях української державності",
      "discription":"Під час екскурсії ви почуєте розповідь про боротьбу за українську державність часів Гетьманщини, дізнаєтеся про державні утворення України, які засновувалися століття тому, а також ознайомитеся з історією проголошення Незалежності України та боротьби за її майбутнє в новітній історії.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "BarrierFree":"Так",
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT5",
      "name":"Конституція – шляхами творення",
      "discription":"Під час екскурсії ви дізнаєтесь, якими були перші закони давньоруської держави та Конституція Війська Запорізького, Універсали УНР, та як приймався Основний Закон незалежної України.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "BarrierFree":"Так",
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT6",
      "name":"Меценати Києва",
      "discription":"Під час екскурсії ви почуєте про традиції благодійництва та відомі родини меценатів Києва, які жили у місті більше століття тому, дізнаєтеся про їхній внесок у збереження музейних цінностей, а також про те, як власна оселя могла стати домом молитви чи музеєм.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT7",
      "name":"Як козаки та магістрат на Подолі жили",
      "discription":"Під час екскурсії ви відкриєте таємниці середньовічного Подолу та дізнаєтеся про традиції Київського самоуправління.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "Barrier-free":"Так",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT8",
      "name":"Таємниці града Ярослава",
      "discription":"Під час екскурсії ви довідаєтеся про оборонні споруди навколо Києва за часів правління князя Ярослава Мудрого, розкриєте таємниці Софійського та Михайлівського соборів і ще багато цікавих фактів про стародавній Київ.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT9",
      "name":"Таємниці града Володимира",
      "discription":"Під час екскурсії ви почуєте про розбудову Києва та будівництво оборонних споруд князем Володимиром, дізнаєтеся про зведення першого кам’яного храму Київської держави – Десятинної церкви, а також розкриєте таємниці Володимирської гірки.",
      "type":"withHearing",
      "type1":"withVisual",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT10",
      "name":"Київ незламний",
      "discription":"Прогулянка ознайомить містян і гостей столиці з історією воєнного Києва – з часів Другої світової війни і до повномасштабного вторгнення.",
      "type":"withHearing",
      "type1":"withVisual",
      "type2":"limitedMobility",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
    {
      "uuid":"uT11",
      "name":"Київ історичний",
      "discription":"Познайомтеся з історією стародавнього Києва, його пам’ятками, архітектурою, історичним центром і Подолом.",
      "type":"withHearing",
      "type1":"withVisual",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT12",
      "name":"Київ хрещатий",
      "discription":"Познайомтеся із головною вулицею столиці, її видатними об'єктами, довідайтеся про відомих особистостей, які свого часу жили на Хрещатику та відігравали важливу роль у розвитку Києва в цілому та його центральної вулиці зокрема.",
      "type":"withHearing",
      "type1":"withVisual",
      "type2":"limitedMobility",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT13",
      "name":"Київ незвичний – від минулого до сьогодення",
      "discription":"Відкрийте для себе незвичні місця Києва та історії про людей, які з ними пов’язані.",
      "type":"withHearing",
      "type1":"withVisual",
      "type2":"",
      "length":"120 хв.",
      "price": 1000,
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT14",
      "name":"Київ європейський",
      "discription":"Під час прогулянки ви познайомитеся з архітектурою Києва та різноманітними об’єктами, які пов’язують наше місто з Європою, а також зі спорудами, які були збудовані європейськими архітекторами.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT15",
      "name":"Конституція – від створення до сьогодення",
      "discription":"Познайомтеся з Основним Законом України від часів його першої розробки до сьогодення.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT16",
      "name":"Шляхами становлення Незалежності України",
      "discription":"Познайомтеся з історією становлення України як вільної держави та з особистостями, які відіграли ключову роль у її становленні та боротьбі за Незалежність, а також з місцями, які пов’язують нас з цими історичними подіями.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT17",
      "name":"Київ містичний",
      "discription":"Під час екскурсії ви познайомитеся з містичною історією міста Києва та різноманітними об’єктами, які пов’язують його з потойбіччям, відьмами й усілякою нечистою силою, яка за легендами існує у міських спорудах, зокрема у деяких замках Києва. Крім того, ви дізнаєтеся про одного із найзловісніших птахів у народних віруваннях, якого в українському фольклорі називають символом загибелі.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT18",
      "name":"Відомий і невідомий Печерськ",
      "discription":"Познайомтеся з одним із найдавніших районів Києва – Печерськом, його історичними та військовими об’єктами, зокрема, й з найвідомішими оборонними спорудами та пам’яткою архітектури світового значення.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT19",
      "name":"Київ: стежиною воєнної історії",
      "discription":"Познайомтеся з одним із найдавніших районів Києва – Печерськом, його історичними та військовими об’єктами, зокрема, й з найвідомішими оборонними спорудами та пам’яткою архітектури світового значення.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT20",
      "name":"Київ: нескорені та незалежні",
      "discription":"Під час екскурсії ви дізнаєтеся про драматичні моменти боротьби за Незалежність України, побачите місця, що зберігають пам’ять про героїв війн та революцій, визначних діячів громадсько-культурного руху, талановитих вчених та митців, образи яких повсякчас стоять на варті нашої національної самобутності.",
      "type":"withHearing",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT21",
      "name":"Київ: у вирі романтики",
      "discription":"Під час прогулянки ви побачите культові романтичні обʼєкти міста та дізнаєтеся про любовні історії його відомих мешканців.",
      "type":"Безоплатні екскурсії",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT22",
      "name":"Київ – наймальовничіша столиця Європи",
      "discription":"На вас чекає атмосферна подорож вулицями історичного Голосієва, де неймовірні пейзажі, що поєднують колоритність архітектурних стилів із величезним розмаїттям дерев і рослин, доведуть, що недарма Київ займає високі позиції в рейтингах найбільш озеленених європейських міст.",
      "type":"withHearing",
      "type1":"",
      "type2":"limitedMobility",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT23",
      "name":"Ключ до милосердя",
      "discription":"Під час активної інтелектуальної гри ви дізнаєтеся не лише про таємниці та цікавинки одного з наймальовничіших історичних куточків столиці, але й наблизитеся до джерела милосердя, яке є таким необхідним у період складного воєнного сьогодення.",
      "type":"Безоплатні екскурсії",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT24",
      "name":"Печерські історії",
      "discription":"Прогулюючись вулицею Бастіонною, ви дізнаєтесь про літописний Звіринець та старовинні монастирі XII століття, оглянете Звіринецьке укріплення Київської фортеці та дізнаєтеся про катастрофу, що сталася тут сто років тому. Відвідаєте затишні дворики, споруджені у 1950-х роках, а також дізнаєтеся історію будівництва Ботанічного саду на Печерських пагорбах.",
      "type":"regionalExcurs",
      "type1":"withHearing",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT25",
      "name":"Прогулянка сучасною Оболонню",
      "discription":"Прогулюючись сучасним житловим масивом від станції метро «Мінська» до Оболонської набережної та мальовничого парку «Наталка», ви дізнаєтеся про історію облаштування та створення різних цікавих меморіалів і об'єктів інфраструктури в цій місцевості, серед яких – новий пішохідний міст-хвиля, який з'єднує набережну з Оболонським островом.",
      "type":"regionalExcurs",
      "type1":"withHearing",
      "type2":"withVisual",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT26",
      "name":"Старим Подолом",
      "discription":"Ви прогуляєтеся знаменитою вулицею Петра Сагайдачного, довідаєтеся, як змінювався Поділ від початку розбудови до сьогодення, познайомитеся з його унікальними з точки зору історії та архітектури об’єктами, серед яких – найстаріший будинок Києва, Аптека-музей, Києво-Могилянська академія (заснована 400 років тому) та старовинні храми.",
      "type":"regionalExcurs",
      "type1":"withHearing",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT27",
      "name":"Зустріч на перехресті Науки",
      "discription":"Пориньте у атмосферну подорож мальовничим куточком столиці – Голосієвом, який є осередком низки провідних науково-дослідницьких інститутів України. Дізнайтеся про досягнення та відкриття видатних науковців, які тут мешкали й працювали.",
      "type":"regionalExcurs",
      "type1":"withHearing",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT28",
      "name":"Святошинське намисто",
      "discription":"Під час прогулянки ви дізнаєтеся про те, як створювався та розбудовувався Святошинський район – від невеликого курортно-дачного передмістя Києва до густонаселеного житлового масиву, почуєте про видатних особистостей, які тут жили, та про наукові відкриття, які робилися в цій місцевості.",
      "type":"regionalExcurs",
      "type1":"withHearing",
      "type2":"limitedMobility",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT29",
      "name":"Мандрівка до Будинку природи",
      "discription":"На шляху до Будинку природи юні дослідники дізнаються про важливість впливу навколишнього середовища на життя людини, після чого в самому будинку ознайомляться з унікальною флорою та фауною, а також отримають безліч нових емоцій.",
      "type":"childrensExcurs",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT30",
      "name":"Пізнаємо Київ – обираємо професію",
      "discription":"Під час прогулянки діти та їхні батьки дізнаються про різноманітні події в історії України, а також ознайомляться із сутністю ряду професій. В ході гри, використовуючи надану інформацію, юні дослідники вирішуватимуть задачі, подолання яких приведе до розкриття важливого гасла для нашої столиці.",
      "type":"childrensExcurs",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"120 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT31",
      "name":"Київ: слідами українських дисидентів",
      "discription":"Запрошуємо зануритися в історію та життя видатних борців за свободу України 1960-1980-х років: Алли Горської, Валерія Марченка, Василя Макуха, Василя Стуса, В’ячеслава Чорновола, Василя Симоненка, Івана Драча, Георгія Москаленка та Валентини Кукси. Під час зустрічі ви дізнаєтеся про їхню боротьбу за національну ідентичність, права людини та свободу слова, побачите місця їхнього проживання та діяльності, які стали свідками важливих історичних подій.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT32",
      "name":"Герої російсько-української війни в топонімах Києва",
      "discription":"Запрошуємо зануритися в історію та життя видатних борців за свободу України 1960-1980-х років: Алли Горської, Валерія Марченка, Василя Макуха, Василя Стуса, В’ячеслава Чорновола, Василя Симоненка, Івана Драча, Георгія Москаленка та Валентини Кукси. Під час зустрічі ви дізнаєтеся про їхню боротьбу за національну ідентичність, права людини та свободу слова, побачите місця їхнього проживання та діяльності, які стали свідками важливих історичних подій.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT33",
      "name":"Київ у фалеристичній спадщині та нумізматиці",
      "discription":"Відвідавши лекторій, ви побачите видовищні об'єкти, розташовані на території Києва, які є не лише історичними, архітектурними та мистецькими пам'ятками, але й візитівками України в цілому. Також дізнаєтеся, як ці символи увіковічені у вражаючих металевих нагородах та монетах, відтворених протягом століть.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT34",
      "name":"Київ та кияни у вирі загадок Другої світової війни",
      "discription":"Під час зустрічі ви дізнаєтеся, що відомості про Другу світову війну містять у собі чимало загадок, а також цікаві факти про події того часу.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT35",
      "name":"Київські адреси родини Кричевських",
      "discription":"Під час зустрічі ви довідаєтеся про життєві історії членів великої родини українських художників Кричевських, київські адреси та памʼятні місця, пов’язані з ними. Пізнаєте знайомий нам Київ та українські пейзажі в роботах художників, а також почуєте про повернення в Україну мистецького спадку Кричевських нащадками роду та про збереження памʼяті про них в часи незалежності.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT36",
      "name":"Видатні кияни, яких знає весь світ",
      "discription":"Під час зустрічі ви почуєте історію про видатних осіб, народжених у Києві, які своєю діяльністю і досягненнями прославили місто на всесвітньому рівні.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT37",
      "name":"Кияни відомі та невідомі",
      "discription":"На зустрічі піде мова про митців, які народилися в Києві, і своїми видатними здобутками принесли славу місту.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT38",
      "name":"Відомі гості Києва",
      "discription":"Під час зустрічі ви дізнаєтеся про відомих особистостей, які відвідували Київ, почуєте про те, які враження справило на них місто і які доленосні зустрічі подарувало.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   },
   {
      "uuid":"uT39",
      "name":"Втрачена краса Києва",
      "discription":"ППід час зустрічі ви почуєте, як і через які обставини Київ почав змінювати своє архітектурне обличчя, скільки пам'яток знищила радянська влада та дізнаєтеся, якої архітектурної катастрофи Києву вдалось уникнути в 1930-х роках.",
      "type":"lectures",
      "type1":"",
      "type2":"",
      "price": 1000,
      "length":"60 хв.",
      "language":"українська",
      "picture":"https://kyivcity.gov.ua/img/item/966455/imgbig.jpg"
   }
   ];
   
   const getTotalPrice = (items)=>{
    return items.reduse((acc, item) =>{
        return acc += item.price
    }, 0);
   };

const ProductList = () =>{
     const [addedItems, setAddedItems] = useEffect([]);

     const{tg} = useTelegram();

     const onAdd = (ture) =>{
        const alredyAdded = addedItems.find(item => item.uuid === ture.uuid);
        let newItems = [];
        if(alredyAdded){
            newItems = addedItems.filter(item => item.uuid !== ture.uuid)
        } else {
            newItems = [...addedItems, ture];
        }
         setAddedItems(newItems)

         if(newItems === 0 ){
            tg.MainButton.hide();
         }else {
            tg.MainButton.show();
            tg.MainButton.setParams({
                text:`Купити ${getTotalPrice(newItems)}`
            })
         }
     }
    return(
     <div className={'list'}>
       {true.map(item => (
        <ProductItem
          ture={item}
          onAdd={onAdd}
          className={"item"}
        />
       ))}
     </div>
    );
}

export default ProductList; 

